In [1]:
import numpy as np
import pandas as pd

# Pandas - DataFrame
* 修改DataFrame
* 保存DataFrame

## 修改DataFrame
* 修改某些数据
    * 通过loc/iloc修改
    * 通过np.where修改
    * 错误修改dataframe的方法
* 修改列和index

### 通过 loc/iloc修改

In [9]:
df=pd.DataFrame({'apples':[3,2,1,9],
'oranges':[7,2,1,3],
'cherry':[4,2,6,1]})
df

   apples  oranges  cherry
0       3        7       4
1       2        2       2
2       1        1       6
3       9        3       1

In [10]:
df1=df.copy()
df1

   apples  oranges  cherry
0       3        7       4
1       2        2       2
2       1        1       6
3       9        3       1

In [11]:
df1.loc[df1['apples']>2,'cherry']=10
df1

   apples  oranges  cherry
0       3        7      10
1       2        2       2
2       1        1       6
3       9        3      10

In [12]:
df

   apples  oranges  cherry
0       3        7       4
1       2        2       2
2       1        1       6
3       9        3       1

In [13]:
df1.loc[[1,2],'oranges']=100
df1

   apples  oranges  cherry
0       3        7      10
1       2      100       2
2       1      100       6
3       9        3      10

In [15]:
df1.iloc[[0,1],2]=100
df1

   apples  oranges  cherry
0       3        7     100
1       2      100     100
2       1      100       6
3       9        3      10

In [17]:
df

   apples  oranges  cherry
0       3        7       4
1       2        2       2
2       1        1       6
3       9        3       1

### 通过np.where修改

In [18]:
df['cherry']=np.where(df['apples']>2,10,df['cherry'])
df

   apples  oranges  cherry
0       3        7      10
1       2        2       2
2       1        1       6
3       9        3      10

### 错误修改dataframe的方法

In [23]:
df[df['apples']>2]['cherry']=100

C:\Users\yvonn\anaconda3\envs\base (root)\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [24]:
df

   apples  oranges  cherry
0       3        7      10
1       2        2       2
2       1        1       6
3       9        3      10

In [33]:
dfcopy=df.T[[0,1]].T
dfcopy

   apples  oranges  cherry
0       3        7      10
1       2        2       2

In [34]:
dfcopy['cherry']=100
dfcopy

   apples  oranges  cherry
0       3        7     100
1       2        2     100

### 修改列
* 添加列
* 修改列和index

#### 添加列

In [35]:
df

   apples  oranges  cherry
0       3        7      10
1       2        2       2
2       1        1       6
3       9        3      10

In [37]:
df['watermelon']=[4,3,2,1]
df

   apples  oranges  cherry  watermelon
0       3        7      10           4
1       2        2       2           3
2       1        1       6           2
3       9        3      10           1

In [39]:
df['watermelon']=100
df

   apples  oranges  cherry  watermelon
0       3        7      10         100
1       2        2       2         100
2       1        1       6         100
3       9        3      10         100

In [41]:
df['watermelon']=pd.Series([4,3,2,1],name='water')
df

   apples  oranges  cherry  watermelon
0       3        7      10           4
1       2        2       2           3
2       1        1       6           2
3       9        3      10           1

#### 修改列和index

In [42]:
df.columns

Index(['apples', 'oranges', 'cherry', 'watermelon'], dtype='object')

In [44]:
df.columns=['apples', 'oranges', 'apples1', 'melon']
df

   apples  oranges  apples1  melon
0       3        7       10      4
1       2        2        2      3
2       1        1        6      2
3       9        3       10      1

In [46]:
df.rename(columns={'melon':'watermelon'},inplace=True)
df

   apples  oranges  apples1  watermelon
0       3        7       10           4
1       2        2        2           3
2       1        1        6           2
3       9        3       10           1

In [47]:
df.rename(index={0:'zero'})

      apples  oranges  apples1  watermelon
zero       3        7       10           4
1          2        2        2           3
2          1        1        6           2
3          9        3       10           1

## 保存dataframe

In [50]:
df.to_csv('df.csv',index=False,sep=',')

In [51]:
pd.read_csv('df.csv')

   apples  oranges  apples1  watermelon
0       3        7       10           4
1       2        2        2           3
2       1        1        6           2
3       9        3       10           1

In [52]:
df

   apples  oranges  apples1  watermelon
0       3        7       10           4
1       2        2        2           3
2       1        1        6           2
3       9        3       10           1

### 课后练习

In [ ]:
复制一个df，命名为df3。 新增一个close column，对open值大于100的行数，open等于close，其余行close是nan

对df3基于close排序，递减排序